Merge pull request #58 from sixtysixx/master
readme revamp
